<template>
  <div class="about">
    <h1>Игра на внимательность</h1>
    <p>
      Представлено игровое поле размером 10 x 10. В каждой ячейке одно число в
      диапазоне от 1 до 100. Цифры в ячейках не повторяются. Ячейки расположены
      в случайном порядке. Все числа в ячейках разного размера и цвета.
      Пользователь может кликнуть по ячейке, и она закрасится, только в том
      случае если номер в ней идёт по порядку, т.е. в начале пользователь ищет
      ячейку с цифрой один, затем два, и т.д. до последней ячейки с номером 100
      (нажав на которую игра заканчивается.
    </p>
  </div>
</template>

<style scoped>
  p {
    max-width: 800px;
    margin: 10px auto;
    border: 1px solid grey;
    border-radius: 8px;
    padding: 20px;
    font-size: 1.2em;
  }
</style>
